[
  {
    "title": "Company floats data center within Bismarck city limits",
    "description": "Aurum Capital Ventures land agent Charlie White told the Burleigh County Commission that the company is looking at 300 acres of county-owned land in east Bismarck.",
    "source": "INFORUM",
    "url": "https://www.inforum.com/business/company-floats-data-center-within-bismarck-city-limits"
  },
  {
    "title": "Hunting for clouds made in the purest air",
    "description": "Scientists are venturing to the Southern Ocean to study clouds and the world's cleanest air to better understand climate change and the impact of human activity on the Earth's atmosphere.",
    "source": "ABC News (AU)",
    "url": "https://www.abc.net.au/news/2025-06-21/southern-ocean-clouds-cleanest-air-climate-change-study/105285522"
  },
  {
    "title": "The Moment Iranian Missiles Hit & Israel’s Iron Dome Failed",
    "description": "Israel is reportedly trying to suppress this footage — the exact moment Iranian ballistic missiles struck and the Iron Dome defense system failed to intercept them. Captured during the height of the Iran-Israel conflict, this rare clip exposes the vulnerabili…",
    "source": "Freerepublic.com",
    "url": "https://freerepublic.com/focus/f-news/4324322/posts"
  },
  {
    "title": "India powerful player in science and tech space: UK minister",
    "description": "London, June 20: The UK must harness scientific and academic relationships with India as it becomes an increasingly powerful player in the science and technology space, Britain’s minister for science, research and innovation has said. During a session on ‘Unl…",
    "source": "Thehillstimes.in",
    "url": "https://thehillstimes.in/international/india-powerful-player-in-science-and-tech-space-uk-minister"
  },
  {
    "title": "IBM Unveils Starling: Roadmap to Fault-Tolerant Quantum Computing",
    "description": "IBM unveils Starling, a fault-tolerant quantum computer, with a roadmap to 2,000 logical qubits and 1B operations by 2033.\nIBM has announced a bold vision to deliver the world's first large-scale, fault-tolerant quantum computer, marking a pivotal step toward…",
    "source": "Storagereview.com",
    "url": "https://www.storagereview.com/news/ibm-unveils-starling-roadmap-to-fault-tolerant-quantum-computing"
  },
  {
    "title": "Robotaxi launch: Event date, place, time and all news about Tesla's new autonomous vehicle",
    "description": "Tesla's long-awaited robotaxi service is tentatively set to launch in Austin, Texas, on June 22, pending safety checks. This launch is significant for Tesla's future in the self-driving market, though challenges and regulatory hurdles remain. Initial operatio…",
    "source": "The Times of India",
    "url": "https://economictimes.indiatimes.com/news/international/us/robotaxi-launch-event-date-place-time-and-all-news-about-teslas-new-autonomous-vehicle/articleshow/121981615.cms"
  },
  {
    "title": "libxml2 maintainer ends embargoed vulnerability reports, citing unsustainable burden",
    "description": "The lone volunteer maintainer of libxml2, one of the open source ecosystem’s most widely used XML parsing libraries, has announced a policy shift that drops support for embargoed security vulnerability reports. This change highlights growing frustration among…",
    "source": "Osnews.com",
    "url": "https://www.osnews.com/story/142614/libxml2-maintainer-ends-embargoed-vulnerability-reports-citing-unsustainable-burden/"
  },
  {
    "title": "Researchers Scanned the Brains of ChatGPT Users and Found Something Deeply Alarming",
    "description": "Scientists at the Massachusetts Institute of Technology have found some startling results in the brain scans of ChatGPT users, adding to the growing body of evidence suggesting that AI is having a serious — and barely-understood — impact on its users' cogniti…",
    "source": "Biztoc.com",
    "url": "https://biztoc.com/x/c2caf44577f0855c"
  },
  {
    "title": "EU introduces new smartphone energy labels to guide buyers and cut emissions",
    "description": "From June 20, 2025, smartphone and tablet buyers in the European Union will begin seeing a new energy label on every device sold. These labels, ...\nThe post EU introduces new smartphone energy labels to guide buyers and cut emissions appeared first on Gizchin…",
    "source": "Gizchina.com",
    "url": "https://www.gizchina.com/2025/06/20/eu-introduces-new-smartphone-energy-labels-to-guide-buyers-and-cut-emissions/"
  },
  {
    "title": "WORLD FIRST: AI AGENTS OF LEONARDO DA VINCI AND ADA LOVELACE KEYNOTES, + 80 SPEAKERS AS UK HOSTS LANDMARK BUSINESSABC AI GLOBAL SUMMIT",
    "description": "The historic convergence of artificial intelligence and human heritage marks a new chapter in the global technology discourse. The Summit brings together 1300+ global trailblazers from government, industry, and academia to define a human-centric future for ar…",
    "source": "PR Newswire UK",
    "url": "https://www.prnewswire.co.uk/news-releases/world-first-ai-agents-of-leonardo-da-vinci-and-ada-lovelace-keynotes--80-speakers-as-uk-hosts-landmark-businessabc-ai-global-summit-302487395.html"
  },
  {
    "title": "15 sets of twins are graduating from one New York high school",
    "description": "Most, when prodded, give a playful shrug at the curious phenomenon at Long Island's Plainview-Old Bethpage John F. Kennedy High School.",
    "source": "Roanoke Times",
    "url": "https://roanoke.com/news/nation-world/education/article_6137fed4-9e89-5b4b-926f-3fb5354ca2f9.html"
  },
  {
    "title": "30 Hot 2025 AI/Tech Wins + Hormone-Smart Weight Loss for Teachers",
    "description": "From the Cool Cat Teacher Blog by Vicki Davis Subscribe to the 10 Minute Teacher Podcast anywhere you listen to podcasts.\nLearn about tips for weight loss for teachers after age 40 from expert Jennifer Edwards. Also, dig into 30 hot AI and technology news sto…",
    "source": "Coolcatteacher.com",
    "url": "https://www.coolcatteacher.com/health/"
  },
  {
    "title": "Enel + Nissan LEAF second life battery storage project goes online",
    "description": "Originally announced two years ago, a joint energy storage project between European energy firm Enel and Nissan has come online, giving LEAF batteries a second chance at life and ensuring electrical supply for more than 90,000 people.\n\n\n\n more…",
    "source": "Electrek",
    "url": "http://electrek.co/2025/06/20/enel-nissan-leaf-second-life-battery-storage-project-goes-online/"
  },
  {
    "title": "Bitcoin, Dogecoin Targeted as Norway Eyes Ban on New Crypto Mining Operations",
    "description": "The government said it will \"explore the possibility of temporarily prohibiting the establishment of new data centers in Norway that extract cryptocurrency.\"",
    "source": "Decrypt",
    "url": "https://decrypt.co/326280/bitcoin-dogecoin-targeted-norway-eyes-ban-new-crypto-mining-operations"
  },
  {
    "title": "Meta and Oakley launch AI-driven Performance Glasses with new HSTN model",
    "description": "Meta and Oakley have joined hands to unveil a new category of AI-powered glasses featuring a built-in camera, open-ear speaker, and more. Read more...",
    "source": "Neowin",
    "url": "https://www.neowin.net/news/meta-and-oakley-launch-ai-driven-performance-glasses-with-new-hstn-model/"
  },
  {
    "title": "Yoshinobu Yamamoto's immaculate inning was ruined by a bad call",
    "description": "Ohtani was one strike away from achieving an immaculate inning, but a controversial decision by umpire Marvin Hudson denied him a historic moment in the game between the Dodgers and Padres  Leer",
    "source": "Marca",
    "url": "https://www.marca.com/en/mlb/los-angeles-dodgers/2025/06/20/6855b28de2704ea07b8b45a0.html"
  },
  {
    "title": "Lipella Pharmaceuticals Announces Delisting from Nasdaq Capital Market",
    "description": "Lipella Pharmaceuticals Announces Delisting from Nasdaq Capital Market......",
    "source": "GlobeNewswire",
    "url": "https://www.globenewswire.com/news-release/2025/06/20/3102906/0/en/Lipella-Pharmaceuticals-Announces-Delisting-from-Nasdaq-Capital-Market.html"
  },
  {
    "title": "Anthropic says most AI models, not just Claude, will resort to blackmail | TechCrunch",
    "description": "New research from Anthropic suggests that most leading AI models exhibit a tendency to blackmail, when it's the last resort in certain tests.",
    "source": "TechCrunch",
    "url": "https://techcrunch.com/2025/06/20/anthropic-says-most-ai-models-not-just-claude-will-resort-to-blackmail/"
  },
  {
    "title": "RRG Alert Tech Vaults to ‘Leading'—Is XLK Signaling a New Rally?",
    "description": "This week, Julius breaks down the current sector rotation using his signature Relative Rotation Graphs, with XLK vaulting into the leading quadrant while utilities and staples fade. He spotlights strength in the technology sector, led by semiconductors and el…",
    "source": "Stockcharts.com",
    "url": "https://stockcharts.com/articles/rrg/2025/06/rrg-alert-tech-vaults-to-leadi-155.html"
  },
  {
    "title": "Adobe Unveils New Camera App for iPhone Users",
    "description": "Adobe has launched a new camera app for iPhone users. Called Project Indigo, the free application is available for download from the App Store. Developed ...\nThe post Adobe Unveils New Camera App for iPhone Users appeared first on Gizchina.com.",
    "source": "Gizchina.com",
    "url": "https://www.gizchina.com/2025/06/20/adobe-unveils-new-camera-app-for-iphone-users/"
  },
  {
    "title": "3 ‘next-level brain hacking’ methods biohackers love — a high-tech tool gives you ‘40 years of mediation benefits’ in just days",
    "description": "Biohacking isn’t just about six-packs and stem cells anymore.",
    "source": "New York Post",
    "url": "https://nypost.com/2025/06/20/health/3-next-level-brain-hacking-methods-biohackers-love/"
  },
  {
    "title": "AMC Entertainment Now Announces A New Initiative Coming This Summer",
    "description": "AMC Entertainment announces a 50% ticket price reduction starting July 9, 2025, making movies more accessible for all.",
    "source": "Franknez.com",
    "url": "https://franknez.com/amc-entertainment-now-announces-a-new-initiative-coming-this-summer/"
  },
  {
    "title": "Alien: Earth Poster: Not the Kind of Change We're Looking to Embrace",
    "description": "Okay, we're just going to put it out there. Based on what we've been getting from FX Networks and Showrunner Noah Hawley's (FX's Fargo) Sydney Chandler (Pistol, Sugar)-starring Alien: Earth, our planet is kinda f***ed. And if you think the latest key poster o…",
    "source": "Bleeding Cool News",
    "url": "https://bleedingcool.com/tv/alien-earth-poster-not-the-kind-of-change-were-looking-to-embrace/"
  },
  {
    "title": "Platformonomics TGIF #91: June 20, 2025",
    "description": "Platformonomics TGIF is a weekly roll-up of links, comments on those links, and perhaps a little too much tugging on my favorite threads. Get Platformonomics Updates By Email News Socrates Says Writing Will Rot Your Brain Academics Say ChatGPT Will Rot Your B…",
    "source": "Platformonomics.com",
    "url": "https://platformonomics.com/2025/06/platformonomics-tgif-91-june-20-2025/"
  },
  {
    "title": "'The biggest betrayal': A year on, staff grieve Ontario Science Centre's snap closure",
    "description": "In the year since the abrupt closure of the Ontario Science Centre, the cost of a new site at Ontario Place has escalated, its opening date has been pushed back and there is no sign of a temporary location.",
    "source": "Citynews.ca",
    "url": "https://toronto.citynews.ca/2025/06/20/the-biggest-betrayal-a-year-on-staff-grieve-ontario-science-centres-snap-closure/"
  },
  {
    "title": "Come With Me to the BILD Photo Expo in NYC",
    "description": "New York City recently hosted an excellent, two‑day photo expo aimed at photographers, content creators, and filmmakers. Presented by BH Photo, the oddly named BILD Expo hosted presentations and panels featuring photographers from a variety of genres and eras…",
    "source": "Fstoppers",
    "url": "https://fstoppers.com/editorial/come-me-bild-photo-expo-nyc-704824"
  },
  {
    "title": "The Nike Pegasus Premium Cracks Open “Alabaster”",
    "description": "Though there are still a few of the three vertical/three edition new Nike running grid that we haven’t seen yet, we can comfortably say that...\n\n© Sneaker News, 2025. |\nPermalink\n|\nNo comment\n|\nAdd todel.icio.us\n\n\nThe post The Nike Pegasus Premium Cracks Open…",
    "source": "Sneaker News",
    "url": "https://sneakernews.com/2025/06/20/nike-pegasus-premium-sail-alabaster-anthracite-white-hq2593-104/"
  },
  {
    "title": "Kazakhstan's Two-Step Nuclear Plan Reveals Delicate Diplomacy",
    "description": "It was a completely unsurprising surprise announcement.  In a highly unusual statement issued on June 14, a Saturday, Kazakh authorities said they had selected Russia’s state-owned Rosatom to build Kazakhstan’s first nuclear power plant, binding the country f…",
    "source": "OilPrice.com",
    "url": "https://oilprice.com/Alternative-Energy/Nuclear-Power/Kazakhstans-Two-Step-Nuclear-Plan-Reveals-Delicate-Diplomacy.html"
  },
  {
    "title": "DJ Khaled Summer: A Buyer’s Guide to the Sea-Doo Lineup",
    "description": "We reviewed the Sea-Doo lineup, including the Spark, GTI, and GTX, so you can choose the best Sea-Doo for yourself this summer.",
    "source": "Rolling Stone",
    "url": "http://www.rollingstone.com/product-recommendations/lifestyle/best-sea-doo-lineup-review-buying-guide-1235368776/"
  },
  {
    "title": "These seven under-$50 tools make my tech life a lot easier",
    "description": "From spudgers to SSD cloners to a charger that you can always keep in your pocket, these seven tech tools make my life easier.",
    "source": "Tom's Hardware UK",
    "url": "https://www.tomshardware.com/pc-components/these-seven-under-usd50-tools-make-my-tech-life-a-lot-easier"
  },
  {
    "title": "US patent office wants an AI to scan for prior art, but doesn't want to pay for it",
    "description": "'The selected vendor must be willing to receive consideration that is primarily non-monetary,' says the USPTO The US Patent and Trademark Office is exploring a plan for using AI at the agency to speed up the process of granting patents - but its initial reque…",
    "source": "Theregister.com",
    "url": "https://www.theregister.com/2025/06/20/us_patent_office_ai/"
  },
  {
    "title": "Can Ruvi AI (RUVI) Copy ETH Success? Analysts Say Its Audited Utility Token Might Reach Charts Soon",
    "description": "Ethereum (ETH) changed the game when it introduced smart contracts and opened up the world of decentralized applications (dApps). Ruvi AI (RUVI), an audited utility token combining blockchain technology with artificial intelligence (AI), is being compared to …",
    "source": "ZyCrypto",
    "url": "https://zycrypto.com/can-ruvi-ai-ruvi-copy-eth-success-analysts-say-its-audited-utility-token-might-reach-charts-soon/"
  },
  {
    "title": "Huawei Introduces HarmonyOS 6 with Intelligent Agent Framework and Developer Beta",
    "description": "Huawei kicked off its Developer Conference 2025 with a major reveal—HarmonyOS 6. Taking the stage was Richard Yu, Executive Director at Huawei, who outlined how ...\nThe post Huawei Introduces HarmonyOS 6 with Intelligent Agent Framework and Developer Beta app…",
    "source": "Gizchina.com",
    "url": "https://www.gizchina.com/2025/06/20/huawei-introduces-harmonyos-6-with-intelligent-agent-framework-and-developer-beta/"
  },
  {
    "title": "Pope Leo wades into business regulation, preaching the idea of an ethical AI framework to tech executives",
    "description": "Leo’s namesake Pope Leo XIII advocated for better working conditions during the late 19th and early 20th centuries.",
    "source": "Fortune",
    "url": "https://fortune.com/2025/06/20/pope-leo-ai-regulation-holy-see-vatican-tech/"
  },
  {
    "title": "Chinese Lab Creates Mosquito-Sized Spy Drones",
    "description": "Chinese state media reported on Friday that the National University of Defense Technology (NUDT) in Hunan has created a surveillance “microdrone” the size of a mosquito. \nThe post Chinese Lab Creates Mosquito-Sized Spy Drones appeared first on Breitbart.",
    "source": "Breitbart News",
    "url": "https://www.breitbart.com/asia/2025/06/20/chinese-lab-creates-mosquito-sized-spy-drones/"
  },
  {
    "title": "XRP can not only rise but also earn: holders can unlock new channels for passive income through JA Mining",
    "description": "The price of XRP has fluctuated violently, rising to $2.20 before falling back to about $2.15, affected by market's risk aversion. At the same time, the stablecoin RLUSD launched by Ripple was approved by Dubai, which strengthened its confidence in global exp…",
    "source": "GlobeNewswire",
    "url": "https://www.globenewswire.com/news-release/2025/06/20/3102901/0/en/XRP-can-not-only-rise-but-also-earn-holders-can-unlock-new-channels-for-passive-income-through-JA-Mining.html"
  },
  {
    "title": "Xiaomi Unveils 45W Smart Power Bank With LCD Display via Crowdfunding",
    "description": "Xiaomi has launched a new 45W fast-charging power bank via its crowdfunding platform on the Xiaomi Mall App, and it’s already gaining attention for its ...\nThe post Xiaomi Unveils 45W Smart Power Bank With LCD Display via Crowdfunding appeared first on Gizchi…",
    "source": "Gizchina.com",
    "url": "https://www.gizchina.com/2025/06/20/xiaomi-unveils-45w-smart-power-bank-with-lcd-display-via-crowdfunding/"
  },
  {
    "title": "Elon Musk's robotaxi will have a human driver for 'safety' reasons",
    "description": "As the tentative launch date for Tesla's Robotaxi service approaches, more details are emerging, including the presence of a human safety driver and other key aspects. Read more...",
    "source": "Neowin",
    "url": "https://www.neowin.net/news/elon-musks-robotaxi-will-have-a-human-driver-for-safety-reasons/"
  },
  {
    "title": "The key to Iran's nuclear program lies under these mountains",
    "description": "Deep below a mountain in Iran sits a once-secret uranium enrichment facility which is threatening to drag the United States into the Israel-Iran conflict.",
    "source": "ABC News (AU)",
    "url": "https://www.abc.net.au/news/2025-06-21/inside-irans-fordow-nuclear-bunker/105441722"
  },
  {
    "title": "Missed Early BTC? Analysts Say Ruvi AI (RUVI) Could Be Your Best Bet For Over 100x This Year",
    "description": "If you missed Bitcoin during its early days, dwelling on the lost opportunity is unnecessary. Analysts say Ruvi AI (RUVI) could be your next big chance to secure monumental returns, with projections exceeding 100x ROI in 2025. Combining blockchain technology …",
    "source": "ZyCrypto",
    "url": "https://zycrypto.com/missed-early-btc-analysts-say-ruvi-ai-ruvi-could-be-your-best-bet-for-over-100x-this-year/"
  },
  {
    "title": "Bay State channel-surfers could see higher bills as Massachusetts eye new sales tax",
    "description": "Bay State channel-surfers who buy, rent or lease a cable box from their television provider could soon see a change on their bills.",
    "source": "Boston Herald",
    "url": "https://www.bostonherald.com/2025/06/20/bay-state-channel-surfers-could-see-higher-bills-as-massachusetts-eye-new-sales-tax/"
  },
  {
    "title": "OPPO A5 5G Debuts With 120Hz Display, Military Durability, and a 6000mAh Battery",
    "description": "OPPO has expanded its mid-range lineup in India with the launch of the A5 5G, a rugged, performance-focused smartphone aimed at users who prioritize durability ...\nThe post OPPO A5 5G Debuts With 120Hz Display, Military Durability, and a 6000mAh Battery appea…",
    "source": "Gizchina.com",
    "url": "https://www.gizchina.com/2025/06/20/oppo-a5-5g-debuts-with-120hz-display-military-durability-and-a-6000mah-battery/"
  },
  {
    "title": "GPS Jamming in Strait of Hormuz Raises Maritime Safety Concerns After Tanker Collision",
    "description": "A significant increase in GPS jamming and spoofing incidents along the Iranian coast is raising serious concerns about maritime safety in one of the world’s most critical shipping channels. According...",
    "source": "gcaptain.com",
    "url": "https://gcaptain.com/gps-jamming-in-strait-of-hormuz-raises-maritime-safety-concerns-after-tanker-collision/"
  },
  {
    "title": "Beyond Spock and “What To Expect”: Parenting Rewritten",
    "description": "From Spock to Substack, parenting advice has evolved. Here's how grandparents can stay curious, current, and confidently navigate this new chapter.",
    "source": "Psychology Today",
    "url": "https://www.psychologytoday.com/us/blog/bridging-three-generations/202506/beyond-spock-and-what-to-expect-parenting-rewritten"
  },
  {
    "title": "The AI infrastructure boom: From sovereign compute to global creativity",
    "description": "A tidal wave of AI-driven innovation is reshaping global technology. At its forefront is a massive buildout of next-gen infrastructure — comprising data centers, custom silicon, sovereign AI models and a rising culture of AI entrepreneurship. Given the prolif…",
    "source": "SiliconANGLE News",
    "url": "https://siliconangle.com/2025/06/20/ai-infrastructure-boom-sovereign-ai-compute-global-creativity-roboticsaiinfrastructure/"
  },
  {
    "title": "Xiaomi Smart Band 10 Launches Globally—Ceramic Edition Included at $40",
    "description": "Xiaomi’s wearables lineup just got a global upgrade. The Xiaomi Smart Band 10, previously teased in China, is now making its international debut—and it’s arriving ...\nThe post Xiaomi Smart Band 10 Launches Globally—Ceramic Edition Included at $40 appeared fir…",
    "source": "Gizchina.com",
    "url": "https://www.gizchina.com/2025/06/20/xiaomi-smart-band-10-launches-globally-ceramic-edition-included-at-40/"
  },
  {
    "title": "Bitcoin Hoarder Semler Scientific Appoints New Bitcoin Strategy Director, Aims for 10,000 BTC by Year-End",
    "description": "A major corporate Bitcoin holder is hiring a new BTC Strategy Director with ambitious plans for the end of this year. According to a new press release, medical technology firm Semler Scientific is bringing on Joe Burnett to head up its BTC strategy division. …",
    "source": "The Daily Hodl",
    "url": "https://dailyhodl.com/2025/06/20/bitcoin-hoarder-semler-scientific-appoints-new-bitcoin-strategy-director-aims-for-10000-btc-by-year-end/"
  },
  {
    "title": "Royal Television Society Opens Entries for the RTS Craft and Design Awards 2025",
    "description": "The Royal Television Society (RTS) has opened entries for the RTS Craft & Design Awards 2025. The awards are accepting entries until Sept. 5. Emma Gormley, Managing Director of Daytime at ITV Studios, is returning to chair the Awards. Winners will be unveiled…",
    "source": "Variety",
    "url": "https://variety.com/2025/artisans/news/royal-television-society-rts-craft-and-design-awards-2025-1236436941/"
  },
  {
    "title": "AIXA Miner Launches Free Cloud Mining App to Expand Global Crypto Access",
    "description": "New mobile platform makes AI-powered crypto mining easier and greener for users worldwide New mobile platform makes AI-powered crypto mining easier and greener for users worldwide",
    "source": "GlobeNewswire",
    "url": "https://www.globenewswire.com/news-release/2025/06/20/3102897/0/en/AIXA-Miner-Launches-Free-Cloud-Mining-App-to-Expand-Global-Crypto-Access.html"
  },
  {
    "title": "MPSC schedules interview for IT Officer post",
    "description": "The Meghalaya Public Service Commission (MPSC) has announced that the personal interview for the post of Junior Informatics Officer under the Directorate of Information Technology & Communications will be held on June 25, 2025 at the MPSC office in Shillong. …",
    "source": "Syllad.com",
    "url": "https://www.syllad.com/mpsc-schedules-interview-for-it-officer-post/"
  },
  {
    "title": "MediaTek Unveils Dimensity 8450 Chip: A New Powerhouse for Phones",
    "description": "MediaTek launched its Dimensity 8450 5G, a SoC built on a 4nm process that aims for affordable, high-performance \"pseudo-flagship\" phones.",
    "source": "Android Headlines",
    "url": "https://www.androidheadlines.com/2025/06/mediatek-launches-dimensity-8450-5g-chip-soc.html"
  },
  {
    "title": "Israel-Iran Conflict: Negotiations With European Leaders Fall Flat As Strikes Continue (Live Updates)",
    "description": "The White House says Trump will decide how to respond to Iran within two weeks.",
    "source": "Forbes",
    "url": "https://www.forbes.com/sites/siladityaray/2025/06/20/israel-iran-conflict-negotiations-with-european-leaders-fall-flat-as-strikes-continue-live-updates/"
  },
  {
    "title": "BBC Threatens to Sue Perplexity, Alleging 'Verbatim' Reproduction of Its Content",
    "description": "This isn't the first time the AI company has been accused of infringing on content.",
    "source": "CNET",
    "url": "https://www.cnet.com/tech/services-and-software/bbc-threatens-to-sue-perplexity-alleging-verbatim-reproduction-of-its-content/"
  },
  {
    "title": "Pure Storage's AI Strategy: From Infrastructure Foundation to Intelligent Operations",
    "description": "At Pure Accelerate 2025, Pure Storage positioned itself not just as a storage vendor riding the AI wave, but as a company that's been quietly solving AI infrastructure challenges for six years-long before ChatGPT made headlines.",
    "source": "Vmblog.com",
    "url": "https://vmblog.com:443/archive/2025/06/20/pure-storage-s-ai-strategy-from-infrastructure-foundation-to-intelligent-operations.aspx"
  },
  {
    "title": "How Private Investors Can Fill In The $27 Billion Climate Gap",
    "description": "Private investors can help bridge a $27B climate gap as GGRF funds remain frozen—threatening clean energy access, jobs, and climate solutions nationwide.",
    "source": "Forbes",
    "url": "https://www.forbes.com/sites/morgansimon/2025/06/20/how-private-investors-can-fill-in-the-27-billion-climate-gap/"
  },
  {
    "title": "Nathan Bekke named chief operating officer of Lee Enterprises",
    "description": "Bekke is responsible for news, audience, advertising, production, information technology and BLOX Digital operations.",
    "source": "Quad City Times",
    "url": "https://qctimes.com/tncms/asset/editorial/471bdbd5-8094-4514-9123-d18be239909a/"
  },
  {
    "title": "Forget Tesla's robotaxis – this new VW ID Buzz will soon be the sleekest self-driving ride on the roads",
    "description": "Hitting the streets in 2026, VW's driverless ID Buzz offers space and style, without the need for a driver.",
    "source": "TechRadar",
    "url": "https://www.techradar.com/vehicle-tech/hybrid-electric-vehicles/forget-teslas-robotaxis-this-new-vw-id-buzz-will-soon-be-the-sleekest-self-driving-ride-on-the-roads"
  },
  {
    "title": "Screen Talk Previews ’28 Years Later’ at the Box Office — and Fall Festival Hopefuls",
    "description": "On this week's episode of the IndieWire podcast, we also look at the state of animation with the upcoming \"Elio\" and the success of the live-action \"How to Train Your Dragon.\"",
    "source": "IndieWire",
    "url": "https://www.indiewire.com/features/podcast/28-years-later-box-office-preview-fall-festivals-1235134018/"
  },
  {
    "title": "Tesla invites select few to Texas robotaxi trial with front seat safety monitors",
    "description": "Tesla has sent out invitations to a small group of people to join the limited test of its robotaxi service in Austin, Texas, which is tentatively set to start on Sunday, according to posts and email screenshots on social media. The invitations said a Tesla em…",
    "source": "CNA",
    "url": "https://www.channelnewsasia.com/business/tesla-invites-select-few-texas-robotaxi-trial-front-seat-safety-monitors-5194841"
  },
  {
    "title": "Ukraine Cultural Heritage, Coffee Sustainability Projects, Google, More: Friday ResearchBuzz, June 20, 2025",
    "description": "NEW RESOURCES The Baltic Times: Online Museum of Traditional Art of Ukraine – KROVETS has resumed its work at krovets.ua. “The platform KROVETS offers users unique access to over 3,800 digitized exhibits […]",
    "source": "Researchbuzz.me",
    "url": "https://researchbuzz.me/2025/06/20/ukraine-cultural-heritage-coffee-sustainability-projects-google-more-friday-researchbuzz-june-20-2025/"
  },
  {
    "title": "Meta Launches $399 Oakley AI Glasses With 3K Video Recording",
    "description": "Meta Platforms Inc. is going up-market with its surprise hit smart glasses, rolling out new models with Oakley that are aimed at athletes and include improved video recording.",
    "source": "Financial Post",
    "url": "https://financialpost.com/pmn/business-pmn/meta-launches-399-oakley-ai-glasses-with-3k-video-recording"
  },
  {
    "title": "Trump hits those supplying Iranian military with sanctions",
    "description": "8 companies targeted for their involved in 'procurement' for rogue regime's defense",
    "source": "Wnd.com",
    "url": "https://www.wnd.com/2025/06/trump-hits-those-supplying-iranian-military-sanctions/"
  },
  {
    "title": "47 Times People Took 3D Printing To Another Level And Made These Cool Things",
    "description": "While the words “3D printing” may still conjure up ideas right out of science fiction, some users of the 3D printing subreddit are already creating things from the comfort of their homes. Below we’ve put together photos of some of the most creative projects o…",
    "source": "Boredpanda.com",
    "url": "https://www.boredpanda.com/interesting-3d-printed-things-msn/"
  },
  {
    "title": "AMD's next-gen UDNA graphics cards will support up to 80 Gbps HDMI 2.2 connectivity",
    "description": "According to Kepler_L2, UDNA GPUs – codenamed GFX13 – will support 64 Gbps and 80 Gbps bandwidths over HDMI 2.2 connections. If the report is accurate, it would mean that AMD's next-generation GPUs won't fully utilize the potential of HDMI 2.2, which supports…",
    "source": "TechSpot",
    "url": "https://www.techspot.com/news/108393-amd-next-gen-udna-graphics-cards-support-up.html"
  },
  {
    "title": "Super magnet reveals nuclear fission secrets by testing 100 exotic atomic nuclei",
    "description": "Researchers at Chalmers University of Technology in Sweden carried out nuclear fission reactions in 100 different types of exotic nuclei of elements like platinum, mercury, and lead in a bid to understand the reaction better.In addition to helping us generate…",
    "source": "Freerepublic.com",
    "url": "https://freerepublic.com/focus/f-chat/4324300/posts"
  },
  {
    "title": "Other Barks & Bites for Friday, June 20: Advocate General Tells CJEU to Affirm €4 Billion Antitrust Fine Against Google; Recentive Challenges Section 101 Invalidation of Machine Learning Claims",
    "description": "This week in Other Barks & Bites: Senators Hirono and Blackburn join the bipartisan collection of lawmakers supporting the current version of Section 101 legislative reform; Accenture announces that it will combine several of its professional services as part…",
    "source": "IPWatchdog.com",
    "url": "https://ipwatchdog.com/2025/06/20/barks-recentive-challenges-section-101-invalidation-machine-learning-claims/id=189776/"
  },
  {
    "title": "Billions of Passwords Have Been Leaked in Massive Breach, Researchers Say. Here’s What You Should Know",
    "description": "Researchers believe it is one of the largest data breaches ever.",
    "source": "Time",
    "url": "https://time.com/7296254/passwords-leaked-data-breach/"
  },
  {
    "title": "Logitech’s beloved MX Master mouse gets a bold, button-packed redesign",
    "description": "The design of the Logitech MX Master 4 has leaked and it houses a few visual changes with some possible new features.",
    "source": "Android Headlines",
    "url": "https://www.androidheadlines.com/2025/06/logitechs-beloved-mx-master-mouse-gets-a-bold-button-packed-redesign.html"
  },
  {
    "title": "Deckbuilding Game Based On Brandon Sanderson's Mistborn Saga Is Available At Amazon",
    "description": "Mistborn: The Deckbuilding Game \r\n $45 \r\nSee at Amazon \r\nA new deckbuilding tabletop game based on author Brandon Sanderson's popular Mistborn Saga series is now available to purchase at Amazon for $45. Mistborn: The Deck Building Game is designed for 1-4 pla…",
    "source": "GameSpot",
    "url": "https://www.gamespot.com/articles/mistborn-saga-deckbuilding-game-brandon-sanderson/1100-6532518/"
  },
  {
    "title": "Qlik’s Talend powers new data solutions for circular economy specialist Reworld",
    "description": "Building applications for the circular economy takes reliable data, and sustainable waste solutions provider Reworld Holding Corp. was coming up short in this particular area. The company was struggling with access to reliable data from its various systems an…",
    "source": "SiliconANGLE News",
    "url": "https://siliconangle.com/2025/06/20/qliks-talend-powers-reliable-data-reworld-qlikconnect/"
  },
  {
    "title": "Chernobyl-like nuclear warnings, Fattah missile strikes, and an ‘Islamic Bomb’ have left the Middle East on edge",
    "description": "Israel's strikes have devastated Iran's military leadership and nuclear assets, while Iran responds with advanced missile fire and nuclear threats. The conflict has left hundreds dead, sparked fears of wider escalation, and drawn in regional actors including …",
    "source": "The Times of India",
    "url": "https://economictimes.indiatimes.com/news/defence/israel-iran-war-chernobyl-like-nuclear-warnings-fattah-missile-strikes-and-an-islamic-bomb-have-left-the-middle-east-on-edge/articleshow/121980213.cms"
  },
  {
    "title": "Putin calls on Russia’s partners to discuss new global model of growth",
    "description": "Events like the Open Dialog recently held in Moscow can be a catalyst for “implementing breakthrough ideas,” the Russian president said. Read Full Article at RT.com",
    "source": "RT",
    "url": "https://www.rt.com/russia/620048-putin-partners-discuss-global-model/"
  },
  {
    "title": "HDR Screenshots May Come to Galaxy Phones with One UI 8",
    "description": "Samsung's Android 16-based One UI 8 update is reportedly bringing HDR screenshot support to Galaxy phones. More details here.",
    "source": "Android Headlines",
    "url": "https://www.androidheadlines.com/2025/06/hdr-screenshots-samsung-galaxy-phones-one-ui-8.html"
  },
  {
    "title": "New Study Reveals Startling Surge in Distracted Driving and Its Deadly Consequences",
    "description": "A new analysis by Gruber Law of recently released 2022 crash data is painting a...\nThe post New Study Reveals Startling Surge in Distracted Driving and Its Deadly Consequences appeared first on Social Media Explorer.",
    "source": "Socialmediaexplorer.com",
    "url": "https://socialmediaexplorer.com/media-journalism/new-study-reveals-startling-surge-in-distracted-driving-and-its-deadly-consequences/"
  },
  {
    "title": "Alberta government to fund 16 new collegiate programs for career preparation",
    "description": "Alberta's education ministry will fund 16 new school collegiate programs to increase opportunities for students looking for an early jump on careers.",
    "source": "CBC News",
    "url": "https://www.cbc.ca/news/canada/edmonton/alberta-collegiate-school-program-career-training-1.7566283"
  },
  {
    "title": "Coffee Break: Healthcare and the State of Science, Plus Baseball and Abundance",
    "description": "Part the First. How Did the United States Get This Healthcare System?  I distinctly remember the first time this question occurred to me, because as the child of a union household a visit to the doctor or the Emergency Room (trees were made to fall out of) wa…",
    "source": "Nakedcapitalism.com",
    "url": "https://www.nakedcapitalism.com/2025/06/coffee-break-healthcare-and-the-state-of-science-plus-baseball-and-abundance.html"
  },
  {
    "title": "See how Disney and Pixar's 'Elio' came to life with a visit to Pixar Animation Studios.",
    "description": "See how Disney and Pixar's 'Elio' came to life with a visit to Pixar Animation Studios.abc13.com",
    "source": "KTRK-TV",
    "url": "https://abc13.com/post/see-how-disney-pixars-elio-came-life-visit-pixar-animation-studios/16785093/"
  },
  {
    "title": "The Nike Pegasus Wave “Barely Green” Dips Into Tropical Waters",
    "description": "More and more, the propogation of tech runner silhouettes feels like an arms race: NB issues the New Balance 2000, the Three Stripes drops off...\n\n© Sneaker News, 2025. |\nPermalink\n|\nNo comment\n|\nAdd todel.icio.us\n\n\nThe post The Nike Pegasus Wave \"Barely Gree…",
    "source": "Sneaker News",
    "url": "https://sneakernews.com/2025/06/20/nike-pegasus-wave-barely-green-bleached-turquoise-washed-coral-apricot-agate-ib0612-303/"
  },
  {
    "title": "Workers stuck in 'infinite workday'...",
    "description": "Employees are trapped in an \"infinite workday\" of endless meetings and notifications, according to new data from Microsoft. Can AI help?",
    "source": "CNBC",
    "url": "https://www.cnbc.com/2025/06/20/workers-are-stuck-in-infinite-workday-according-to-microsoft-report.html"
  },
  {
    "title": "Sagteс Finalizes Strategic AI Acquisition to Accelerate SaaS Revenue and Multi-Sector AI Deployment",
    "description": "Definitive Agreement Signed to Acquire 80% of Smart Bridge Technology, a Profitable Agentic AI Platform Definitive Agreement Signed to Acquire 80% of Smart Bridge Technology, a Profitable Agentic AI Platform",
    "source": "GlobeNewswire",
    "url": "https://www.globenewswire.com/news-release/2025/06/20/3102892/0/en/Sagte%D1%81-Finalizes-Strategic-AI-Acquisition-to-Accelerate-SaaS-Revenue-and-Multi-Sector-AI-Deployment.html"
  },
  {
    "title": "Staked Ether hits record high driven by corporate crypto treasury adoption: Finance Redefined",
    "description": "Ether’s staked supply hit a new record high, signaling tightening liquidity conditions amid growing demand for corporate cryptocurrency treasury reserves.",
    "source": "Cointelegraph",
    "url": "https://cointelegraph.com/news/staked-ether-record-high-corporate-crypto-treasury-finance-redefined"
  },
  {
    "title": "Microsoft’s Family Safety app is blocking Chrome on Windows PCs",
    "description": "If your PC won’t open Google Chrome, there may be a culprit: Microsoft. \r\n\n\n\n\nGoogle determined that Microsoft’s Family Safety app is blocking Chrome, though the company hasn’t discovered how or why. “For some users, Chrome is unable to run when Microsoft Fam…",
    "source": "PCWorld",
    "url": "https://www.pcworld.com/article/2823343/microsofts-family-safety-app-is-blocking-chrome-on-windows-pcs.html"
  },
  {
    "title": "Charles Leclerc Reveals He Sleeps 11 Hours a Night With This ‘Intelligent’ Mattress Setup",
    "description": "Leclerc is an ambassador and investor for Eight Sleep, the 'intelligent' sleep pod system that promises to help maximize recovery time and performance",
    "source": "Rolling Stone",
    "url": "http://www.rollingstone.com/product-recommendations/lifestyle/charles-leclerc-eight-sleep-pod-mattress-shop-online-1235362873/"
  },
  {
    "title": "2010 BMW M3 Convertible",
    "description": "This 2010 BMW M3 convertible has 59k miles following registration history in Georgia, Virginia, and Pennsylvania. It is finished in Jerez Black Metallic over Bamboo Beige Novillo leather and is powered by a 4.0-liter V8 paired with a seven-speed dual-clutch t…",
    "source": "Bringatrailer.com",
    "url": "https://bringatrailer.com/listing/2010-bmw-m3-convertible-8-2/"
  },
  {
    "title": "Looks like Aflac is the latest insurance giant snagged in Scattered Spider’s web",
    "description": "If it looks like a duck and walks like a duck...\nAflac is the latest insurance company to disclose a security breach following a string of others earlier this week, all of which appear to be part of Scattered Spider's most recent data theft campaign.…",
    "source": "Theregister.com",
    "url": "https://www.theregister.com/2025/06/20/aflac_scattered_spider/"
  },
  {
    "title": "US Army Appoints Palantir, Meta, OpenAI Execs as Lt. Colonels",
    "description": "Four senior executives at Palantir, Meta, and OpenAI have been formally appointed lieutenant colonels in the US Army following the creation of a “special” unit created for rich Big Tech mavens seeking military leadership roles. On June 13, the Army announced …",
    "source": "Thegrayzone.com",
    "url": "https://thegrayzone.com/2025/06/18/palantir-execs-appointed-colonels/"
  },
  {
    "title": "Foodbank Victoria partners with Qlik to improve food distribution system",
    "description": "Foodbank Victoria is distributing an impressive 25 million meals a year to provide hunger relief. It also runs a school breakfast program that goes out to about 1,200 schools. As those numbers continue to grow, Foodbank Victoria has adopted QlikTech Internati…",
    "source": "SiliconANGLE News",
    "url": "https://siliconangle.com/2025/06/20/foodbank-victoria-qlik-hunger-relief-qlikconnect/"
  },
  {
    "title": "The startups rolling out of Europe’s early-stage micromobility scene | TechCrunch",
    "description": "A handful of early stage micromobility startups out of Europe that are filling the gaps in a maturing ecosystem.",
    "source": "TechCrunch",
    "url": "https://techcrunch.com/2025/06/20/the-startups-rolling-out-of-europes-early-stage-micromobility-scene/"
  },
  {
    "title": "The Gemini app is now available to all education users",
    "description": "What’s changing We are expanding support for the Gemini app  for Google Workspace for Education users of all ages : The Gemini app is covere...",
    "source": "Googleblog.com",
    "url": "http://workspaceupdates.googleblog.com/2025/06/the-gemini-app-is-now-available-for-all-google-workspace-for-education-users.html"
  },
  {
    "title": "Your summer 2025 horoscope is here — and spoiler alert: The stars have big plans for every zodiac sign",
    "description": "Summer 2025 horoscope brings powerful planetary shifts that could shape your love life, career, and personal goals. With Jupiter in Cancer, many signs may see blessings in home and emotional matters, while Uranus in Gemini sparks sudden changes in communicati…",
    "source": "The Times of India",
    "url": "https://economictimes.indiatimes.com/news/international/us/your-summer-2025-horoscope-is-here-and-spoiler-alert-the-stars-have-big-plans-for-every-zodiac-sign/articleshow/121979936.cms"
  },
  {
    "title": "TFINER: Ramping Up Propulsion via Nuclear Decay",
    "description": "Sometimes all it takes to spawn a new idea is a tiny smudge in a telescopic image. What counts, of course, is just what that smudge implies. In the case of the object called ‘Oumuamua, the implication was interstellar, for whatever it was, this smudge was cle…",
    "source": "Centauri-dreams.org",
    "url": "https://www.centauri-dreams.org/2025/06/20/tfiner-ramping-up-propulsion-via-nuclear-decay/"
  },
  {
    "title": "Thief Steals $1,000 From Victim on Universal Ride",
    "description": "A guest at a Universal Studios theme park fell victim to a major $1,000 theft while riding one of its most popular attractions. For decades, Universal has served as Disney’s number-one rival in immersive, themed entertainment. What started as Universal Studio…",
    "source": "Inside the Magic",
    "url": "https://insidethemagic.net/2025/06/universal-studios-japan-theme-park-theft-cj1/"
  },
  {
    "title": "Heather Cox Richardson to Obama: You Didn't Mention How People Who Made All That Money Took Over Political Systems To Weight Everything In Their Favor",
    "description": "Former President Barack Obama, in conversation with historian and author Heather Cox Richardson, at The Connecticut Forum on June 17, 2025.\r\n\r\nBARACK OBAMA: If we're going to fix all these other problems—if we're going to deal with climate change effectively,…",
    "source": "RealClearPolitics",
    "url": "https://www.realclearpolitics.com/video/2025/06/20/heather_cox_richardson_to_obama_you_didnt_mention_how_people_who_made_all_that_money_took_over__political_systems_to_weight_everything_in_their_favor.html"
  },
  {
    "title": "Creating a Successful Digital Product: Community Strategies for an MVP",
    "description": "Creating a new product or service can seem daunting. What should you build? How do you make sure it will meet people's needs? The secret lies in something called a Minimum Viable Product (MVP). \nThe post Creating a Successful Digital Product: Community Strate…",
    "source": "Chrisg.com",
    "url": "https://www.chrisg.com/successful-digital-product-mvp/"
  },
  {
    "title": "Hyundai’s new electric SUV leaks in China, revealing new battery details and more",
    "description": "Hyundai is gearing up to launch what could be its most important EV in China to date. The Elexio, referred to as the Chinese version of Hyundai’s popular IONIQ 5 electric SUV, is expected to play a key role in the company’s comeback efforts in China. Ahead of…",
    "source": "Electrek",
    "url": "http://electrek.co/2025/06/20/hyundais-new-electric-suv-leaks-china-revealing-more-details/"
  },
  {
    "title": "Expert highlights parents' key role in helping kids navigate AI challenges",
    "description": "Parenting has never been an easy job. In each generation, it comes with tough conversations on topics ranging from sex and peer pressure to politics and mortality. In the digital age, that list should continue to grow with family discussions about artificial …",
    "source": "Phys.Org",
    "url": "https://phys.org/news/2025-06-expert-highlights-parents-key-role.html"
  },
  {
    "title": "Intel teases huge leaps for 18A, the tech behind its next-gen ‘Panther Lake’ CPUs",
    "description": "Intel is almost literally betting its future on its upcoming “Panther Lake” CPU architecture, as well as the 18A manufacturing process it will be built upon. While we don’t have any concrete details of how Panther Lake will perform, Intel has publicly reveale…",
    "source": "PCWorld",
    "url": "https://www.pcworld.com/article/2823334/intel-teases-huge-leaps-for-18a-the-tech-behind-its-next-gen-panther-lake-cpus.html"
  },
  {
    "title": "Qlik leads with “ecosystem-first” strategy in servicing customers",
    "description": "A strong partner network is key for managing an increasingly complex infrastructure based on artificial intelligence and the multicloud. QlikTech International AB has prioritized collaboration with companies such as Snowflake Inc., Databricks Inc. and Amazon …",
    "source": "SiliconANGLE News",
    "url": "https://siliconangle.com/2025/06/20/qlik-cloud-ecosystem-partner-network-qlikconnect/"
  }
]